package main

import "fmt"

/*
a. 对问题2中的切片使用插入排序 实现从小到大排序

第一次  拿出107, 排序后
107 108 105 109 103 102

第二次  拿出105，排序后
107 105 108 109 103 102
105 107 108 109 103 102

第三次  拿出 109，排序后
105 107 108 109 103 102

第四次 拿出103, 排序后
105 107 108 103 109 102
105 107 103 108 109 102
105 103 107 108 109 102
103 105 107 108 109 102

第五次  拿出102，排序后
103 105 107 108 102 109
103 105 107 102 108 109
103 105 102 107 108 109
103 102 105 107 108 109
102 103 105 107 108 109
*/

func main() {
	var nums = []int{108, 107, 105, 109, 103, 102}
	for x := 1; x < len(nums); x++ {
		k := nums[x]
		i := x - 1

		for i >= 0 && nums[i] > k {
			nums[i+1] = nums[i]
			i--

		}
		nums[i+1] = k
	}

	fmt.Println(nums)

}
